results/node/effect.txt
Bundle: 354.0 KB
Startup: 79.0 ms
Memory before: 83.5 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     68446.70    8583.10   81545.92
  Latency        7.30ms    24.77ms      2.00s
  HTTP codes:
    1xx - 0, 2xx - 684716, 3xx - 0, 4xx - 0, 5xx - 0
    others - 5
  Errors:
    dial tcp 127.0.0.1:3000: i/o timeout - 5
  Throughput:    13.83MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     61926.80    2889.50   66750.35
  Latency        8.07ms    24.24ms      1.94s
  HTTP codes:
    1xx - 0, 2xx - 619728, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    14.94MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     54769.90    4860.35   60874.42
  Latency        9.12ms    31.43ms      2.02s
  HTTP codes:
    1xx - 0, 2xx - 547925, 3xx - 0, 4xx - 0, 5xx - 0
    others - 50
  Errors:
    dial tcp 127.0.0.1:3000: i/o timeout - 50
  Throughput:    16.50MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       347.44     140.96     578.54
  Latency       28.82ms     1.40ms    44.77ms
  HTTP codes:
    1xx - 0, 2xx - 3470, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.57GB/s

Memory after: 438.0 MB