results/node/elysia-aot.txt
Bundle: 146.0 KB
Startup: 52.0 ms
Memory before: 80.0 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     91397.22    9009.13  117038.54
  Latency        5.47ms    13.83ms      1.29s
  HTTP codes:
    1xx - 0, 2xx - 914081, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    18.30MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     75492.14    6512.48   97030.39
  Latency        6.62ms    18.21ms      1.61s
  HTTP codes:
    1xx - 0, 2xx - 755386, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    18.07MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     82284.76    5655.85   95272.65
  Latency        6.07ms    16.39ms      1.48s
  HTTP codes:
    1xx - 0, 2xx - 823101, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    24.63MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       282.25     163.14     527.84
  Latency       35.41ms     2.16ms    53.89ms
  HTTP codes:
    1xx - 0, 2xx - 2830, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.72GB/s

Memory after: 356.0 MB