results/node/elysia.txt
Bundle: 196.8 KB
Startup: 53.2 ms
Memory before: 80.8 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     99088.25    7806.35  117200.05
  Latency        5.04ms    12.97ms      1.29s
  HTTP codes:
    1xx - 0, 2xx - 990969, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    19.84MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     89416.19    5692.18   99643.36
  Latency        5.59ms    15.08ms      1.42s
  HTTP codes:
    1xx - 0, 2xx - 894446, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    21.40MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     86351.22    5615.72   95823.36
  Latency        5.79ms    15.33ms      1.43s
  HTTP codes:
    1xx - 0, 2xx - 863809, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    25.85MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       263.78     153.21     542.36
  Latency       37.90ms     2.94ms    61.60ms
  HTTP codes:
    1xx - 0, 2xx - 2640, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.48GB/s

Memory after: 349.9 MB