results/node/express.txt
Bundle: 601.9 KB
Startup: 50.5 ms
Memory before: 78.1 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     45848.64    2588.11   50166.41
  Latency       10.90ms    37.98ms      2.10s
  HTTP codes:
    1xx - 0, 2xx - 458830, 3xx - 0, 4xx - 0, 5xx - 0
    others - 65
  Errors:
    dial tcp 127.0.0.1:3000: i/o timeout - 65
  Throughput:     9.92MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     42440.56    1805.37   46161.74
  Latency       11.77ms    40.00ms      2.23s
  HTTP codes:
    1xx - 0, 2xx - 424780, 3xx - 0, 4xx - 0, 5xx - 0
    others - 68
  Errors:
    dial tcp 127.0.0.1:3000: i/o timeout - 68
  Throughput:    10.84MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     36221.23    2162.70   40054.76
  Latency       13.79ms    47.36ms      2.26s
  HTTP codes:
    1xx - 0, 2xx - 362579, 3xx - 0, 4xx - 0, 5xx - 0
    others - 92
  Errors:
    dial tcp 127.0.0.1:3000: i/o timeout - 92
  Throughput:    11.43MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       326.07     176.86     530.10
  Latency       30.68ms     3.11ms    53.32ms
  HTTP codes:
    1xx - 0, 2xx - 3260, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.30GB/s

Memory after: 323.1 MB