results/node/fastify.txt
Bundle: 554.8 KB
Startup: 79.2 ms
Memory before: 87.3 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     99689.69    6024.37  118879.14
  Latency        5.01ms    12.30ms      1.23s
  HTTP codes:
    1xx - 0, 2xx - 996944, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    21.67MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     98646.05    8086.10  118657.42
  Latency        5.07ms    10.04ms      1.07s
  HTTP codes:
    1xx - 0, 2xx - 986814, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    25.30MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     70603.51    9066.43   90591.35
  Latency        7.08ms    20.93ms      1.77s
  HTTP codes:
    1xx - 0, 2xx - 706341, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    22.35MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       324.13     145.11     570.33
  Latency       30.82ms     1.97ms    45.02ms
  HTTP codes:
    1xx - 0, 2xx - 3250, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.28GB/s

Memory after: 444.7 MB