results/node/hono.txt
Bundle: 61.2 KB
Startup: 51.1 ms
Memory before: 83.7 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     91660.64    9022.21  115407.22
  Latency        5.45ms    14.27ms      1.36s
  HTTP codes:
    1xx - 0, 2xx - 916822, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    19.84MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     83170.07    7401.44   98709.67
  Latency        6.01ms    16.64ms      1.56s
  HTTP codes:
    1xx - 0, 2xx - 832050, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    21.25MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     80996.07    7287.70   89090.46
  Latency        6.17ms    18.25ms      1.60s
  HTTP codes:
    1xx - 0, 2xx - 810237, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    24.40MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       275.57     165.67     536.93
  Latency       36.26ms     2.90ms    58.51ms
  HTTP codes:
    1xx - 0, 2xx - 2760, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.63GB/s

Memory after: 333.4 MB